RIET/src/Documents/Service/Service.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Service</name>
  <registerRecords>AccumulationRegister.UnpaidCCDs</registerRecords>
  <registerRecords>AccumulationRegister.НеоплаченныеТПО</registerRecords>
  <attributes>
    <name>Agent</name>
    <type>
      <types>CatalogRef.Agents</types>
    </type>
  </attributes>
  <attributes>
    <name>AgentNo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DocumentBase</name>
    <type>
      <types>DocumentRef.TemporaryImpExpTransactions</types>
      <types>DocumentRef.CustomsFilesLight</types>
      <types>DocumentRef.ExportShipment</types>
      <types>DocumentRef.Поставка</types>
    </type>
  </attributes>
  <attributes>
    <name>Service</name>
    <type>
      <types>CatalogRef.Services</types>
    </type>
  </attributes>
  <attributes>
    <name>Description</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>CCD</name>
    <type>
      <types>DocumentRef.CustomsFilesLight</types>
      <types>DocumentRef.ГТД</types>
    </type>
  </attributes>
  <attributes>
    <name>DaysInCustoms</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Qty</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Price</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Base</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Percent</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Markup</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Sum</name>
    <comment>Сумма до скидки</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Discount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>GrandTotal</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Local</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>InvoiceLines</name>
    <attributes>
      <name>InvoiceLine</name>
      <type>
        <types>CatalogRef.СтрокиИнвойса</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/AccumulationRegisters/NotReceivedAgentInvoices/NotReceivedAgentInvoices.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>NotReceivedAgentInvoices</name>
  <resources>
    <name>Sum</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Service</name>
    <type>
      <types>DocumentRef.Service</types>
    </type>
  </dimensions>
  <dimensions>
    <name>SoldTo</name>
    <type>
      <types>CatalogRef.SoldTo</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

RIET/src/Documents/Service/Forms/ФормаВыбора/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СтруктураНастройки") Тогда
		
		СтруктураНастройки = Параметры.СтруктураНастройки;
		Если СтруктураНастройки.Имя = "ВыборИзServicesCostsAllocation" Тогда
			НастроитьДляВыбораИзServicesCostsAllocation(СтруктураНастройки);
		ИначеЕсли СтруктураНастройки.Имя = "ВыборИзAgentInvoice" Тогда
			НастроитьДляВыбораИзAgentInvoice(СтруктураНастройки);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьДляВыбораИзServicesCostsAllocation(СтруктураНастройки)
	
	МассивUnallocatedServices = CustomsСервер.ПолучитьUnallocatedServices(СтруктураНастройки.Agent, СтруктураНастройки.ServicesCostsAllocation,
											  							  СтруктураНастройки.МассивТекущихServices);
		
	Параметры.Отбор.Вставить("Ссылка", МассивUnallocatedServices);
	Параметры.Отбор.Вставить("ПометкаУдаления", Ложь);
	
КонецПроцедуры 
     
&НаСервере
Процедура НастроитьДляВыбораИзAgentInvoice(СтруктураНастройки)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Date", СтруктураНастройки.Date);
	Запрос.УстановитьПараметр("Agent", СтруктураНастройки.Agent);
	Запрос.УстановитьПараметр("SoldTo", СтруктураНастройки.SoldTo);
	Запрос.УстановитьПараметр("МассивТекущихServices", СтруктураНастройки.МассивТекущихServices);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	NotReceivedAgentInvoicesОстатки.Service
		|ИЗ
		|	РегистрНакопления.NotReceivedAgentInvoices.Остатки(
		|			&Date,
		|			SoldTo = &SoldTo
		|				И Service.Agent = &Agent
		|				И (НЕ Service В (&МассивТекущихServices))) КАК NotReceivedAgentInvoicesОстатки";
	МассивNotReceivedServices = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Service");
		
	Параметры.Отбор.Вставить("Ссылка", МассивNotReceivedServices);
	
КонецПроцедуры
